import {
  CardComponyStyle,
  DivLogo,
  DivText,
  DivBtnShow,
} from "./CardComponyStyles";
import BtnShow from "../../../common/BtnShow/BtnShow";
import { Logo3 } from "../../../Icons/Icons";
const CardCompony = () => {
  return (
    <CardComponyStyle>
      <div className="box">
        <DivLogo className="div-logo">
          <Logo3 width={"166"} height={"155"} />
          <h3>فولاد مبارکه</h3>
          <p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ</p>
        </DivLogo>
        <DivText className="div-text">
          <p>
            لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با
            استفاده لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و
            با استفاده لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ
            و بااستفاده لورم ایپسوم متن ساختگی با تولید سادگیلورم ایپسوم متن
            ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده لورم ایپسوم
            متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده لورم
            ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و بااستفاده
          </p>
          <p>
            استفاده لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و
            با استفاده لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ
            و بااستفاده لورم ایپسوم متن ساختگی ایپسوم متن ساختگی با تولید سادگی
            نامفهوم از صنعت چاپ و با استفاده لورم ایپسوم متن ساختگی با تولید
            سادگی نامفهوم از صنعت چاپ و بااستفاده لورم ایپسوم متن ساختگی با
            تولید سادگی نامفهوم از صنعت چاپ و با استفاده لورم ایپسوم متن ساختگی
            با تولید سادگی نامفهوم از صنعت چاپ و با استفاده لورم ایپسوم متن
          </p>
          <DivBtnShow className="div-show">
            <BtnShow text="مشاهده محصولات" href={"#"} />
          </DivBtnShow>
        </DivText>
      </div>
    </CardComponyStyle>
  );
};

export default CardCompony;
